ExpressLRS/ExpressLRS/src/src/ESP8266_WebUpdate.cpp
#ifdef PLATFORM_ESP8266
#include "ESP8266_WebUpdate.h"

#include <WiFiClient.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <DNSServer.h>
#include <ESP8266HTTPUpdateServer.h>
#include "ESP8266_hwTimer.h"
#include "config.h"

#if defined(Regulatory_Domain_AU_915) || defined(Regulatory_Domain_EU_868) || defined(Regulatory_Domain_FCC_915) || defined(Regulatory_Domain_AU_433) || defined(Regulatory_Domain_EU_433)
#include "SX127xDriver.h"
extern SX127xDriver Radio;
#endif

#if defined(Regulatory_Domain_ISM_2400)
#include "SX1280Driver.h"
extern SX1280Driver Radio;
#endif

#include "ESP8266_WebContent.h"

#define STASSID "ExpressLRS RX"
#define STAPSK "expresslrs"
const char *myHostname = "elrs_rx";

const char *ssid = STASSID;
const char *password = STAPSK;

extern hwTimer hwTimer;
extern RxConfig config;

const byte DNS_PORT = 53;
IPAddress apIP(10, 0, 0, 1);
IPAddress netMsk(255, 255, 255, 0);
DNSServer dnsServer;
//MDNSResponder mdns;
ESP8266WebServer server(80);

ESP8266HTTPUpdateServer httpUpdater;

static int numNetworks;

/** Is this an IP? */
boolean isIp(String str)
{
  for (size_t i = 0; i < str.length(); i++)
  {
    int c = str.charAt(i);
    if (c != '.' && (c < '0' || c > '9'))
    {
      return false;
    }
  }
  return true;
}

/** IP to String? */
String toStringIp(IPAddress ip)
{
  String res = "";
  for (int i = 0; i < 3; i++)
  {
    res += String((ip >> (8 * i)) & 0xFF) + ".";
  }
  res += String(((ip >> 8 * 3)) & 0xFF);
  return res;
}

bool captivePortal()
{
  if (!isIp(server.hostHeader()) && server.hostHeader() != (String(myHostname) + ".local"))
  {
    Serial.println("Request redirected to captive portal");
    server.sendHeader("Location", String("http://") + toStringIp(server.client().localIP()), true);
    server.send(302, "text/plain", ""); // Empty content inhibits Content-length header so we have to close the socket ourselves.
    server.client().stop();             // Stop is needed because we sent no content length
    return true;
  }
  return false;
}

void WebUpdateSendCSS()
{
  server.send_P(200, "text/css", CSS);
}

void WebUpdateSendPNG()
{
  server.send_P(200, "image/png", (PGM_P)PNG, sizeof(PNG));
}

void WebUpdateHandleRoot()
{
  if (captivePortal())
  { // If captive portal redirect instead of displaying the page.
    return;
  }
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "-1");
  server.send_P(200, "text/html", INDEX_HTML);
}

void WebUpdateScanHome(void)
{
  numNetworks = WiFi.scanNetworks();
  server.send_P(200, "text/html", SCAN_HTML);
}

void WebUpdateSendNetworks()
{
  String s;
  s+="[";
  for(int i=0 ; i<numNetworks ; i++) {
    s+="\"" + WiFi.SSID(i) + "\"";
    if (i < numNetworks-1) s+=",";
  }
  s+="]";
  server.send(200, "application/json", s);
}

void WebUpdateSetHome(void)
{
  String ssid = server.arg("network");
  String password = server.arg("password");

  Serial.printf("Joining: %s\n", ssid.c_str());
  WiFi.setHostname(myHostname);
  wl_status_t s = WiFi.begin(ssid, password);
  while(true) {
    s = WiFi.status();
    if (s == WL_CONNECTED) {
      Serial.printf("Connected IPAddress=%s\n", WiFi.localIP().toString().c_str());
      config.SetSSID(ssid.c_str());
      config.SetPassword(password.c_str());
      config.Commit();
      server.sendHeader("Location", "/", true);
      server.send(302, "text/plain", "");
      server.begin();
      return;
    } else if (s == WL_CONNECT_FAILED || s == WL_WRONG_PASSWORD) {
      Serial.println("Connection to network failed");
      server.sendHeader("Location", "/scanhome?error", true);
      server.send(302, "text/plain", "");
      return;
    } else {
      yield();
      delay(50);
    }
  }
}

void WebUpdateHandleNotFound()
{
  if (captivePortal())
  { // If captive portal redirect instead of displaying the error page.
    return;
  }
  String message = F("File Not Found\n\n");
  message += F("URI: ");
  message += server.uri();
  message += F("\nMethod: ");
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += F("\nArguments: ");
  message += server.args();
  message += F("\n");

  for (uint8_t i = 0; i < server.args(); i++)
  {
    message += String(F(" ")) + server.argName(i) + F(": ") + server.arg(i) + F("\n");
  }
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "-1");
  server.send(404, "text/plain", message);
}

void BeginWebUpdate(void)
{
  hwTimer.stop();

  Radio.RXdoneCallback = NULL;
  Radio.TXdoneCallback = NULL;

  Serial.println("Begin Webupdater");
  Serial.println("Stopping Radio");
  Radio.End();

  WiFi.persistent(false);
  WiFi.disconnect();   //added to start with the wifi off, avoid crashing
  WiFi.mode(WIFI_OFF); //added to start with the wifi off, avoid crashing
  WiFi.setOutputPower(13);
  WiFi.setPhyMode(WIFI_PHY_MODE_11B);
  wifi_station_set_hostname(myHostname);
  delay(500);
  WiFi.mode(WIFI_AP_STA);
  WiFi.softAPConfig(apIP, apIP, netMsk);
  WiFi.softAP(ssid, password);

  MDNS.begin(myHostname);
  dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  dnsServer.start(DNS_PORT, "*", apIP);

  server.on("/", WebUpdateHandleRoot);
  server.on("/main.css", WebUpdateSendCSS);
  server.on("/flag.png", WebUpdateSendPNG);
  server.on("/networks.json", WebUpdateSendNetworks);

  server.on("/generate_204", WebUpdateHandleRoot); // handle Andriod phones doing shit to detect if there is 'real' internet and possibly dropping conn.
  server.on("/gen_204", WebUpdateHandleRoot);
  server.on("/library/test/success.html", WebUpdateHandleRoot);
  server.on("/hotspot-detect.html", WebUpdateHandleRoot);
  server.on("/connectivity-check.html", WebUpdateHandleRoot);
  server.on("/check_network_status.txt", WebUpdateHandleRoot);
  server.on("/ncsi.txt", WebUpdateHandleRoot);
  server.on("/fwlink", WebUpdateHandleRoot);
  server.on("/scanhome", WebUpdateScanHome);
  server.on("/sethome", HTTP_POST, WebUpdateSetHome);
  server.onNotFound(WebUpdateHandleNotFound);

  httpUpdater.setup(&server);
  server.begin();
  Serial.printf("HTTPUpdateServer ready! Open http://%s.local in your browser\n", myHostname);

  if (config.GetSSID()[0]) {
    Serial.println("Connecting...");
    WiFi.setHostname(myHostname);
    WiFi.begin(config.GetSSID(), config.GetPassword());
  }
}

void HandleWebUpdate(void)
{
  server.handleClient();
  dnsServer.processNextRequest();
  MDNS.update();
  yield();
}

#endif
